{
    "help": "Provides information about the bot's commands and features.",
    "configsetup": "This command helps you get the bot set up on your server. You have a few options to choose from:\n'dashboard' will give you a link to our web dashboard for an easy, graphical setup experience.\n'manual' will guide you step-by-step through the setup process using Discord commands.\n'auto' will automatically create the necessary roles and channels to get the bot running quickly.\n\n**Permissions:**\n- You'll need the `Manage Server` permission to use this command.\n- The bot needs `Send Messages`, `Embed Links`, and `View Channel` permissions in the channel where you run this command.",
    "permissioncheck": "This command triggers a check to ensure the bot has all the necessary permissions in the channels you've configured for it.\nIt's a great way to diagnose problems if the bot isn't behaving as expected. Any issues found will be reported, usually in your log channel.\n\n**Permissions:**\n- You'll need the `Manage Server` permission to use this command.",
    "messages": "Lets you customize the various messages the bot sends. You can either set a new custom message or remove an existing one to revert it back to the default.\nWhen you choose to 'set' a message, a pop-up will appear for you to enter your new text.\n\n\n**Permissions:**\n- You'll need the `Manage Server` permission to use this command.",
    "toggles": "This command allows you to enable or disable various features of the bot.\nYou can turn things on or off to best suit your server's needs.\n\n**Permissions:**\n- You'll need the `Manage Server` permission to use this command.",
    "approval_toggles": "Use this command to customize the buttons that appear on the verification approval message in your log channel.\nThis allows you to enable or disable specific actions your moderators can take, like banning or noting a user's ID.\n\nI highly recommend using the website, as it provides a more user-friendly interface for configuring these settings. You can see the changes in real-time and understand the impact of each toggle better.\n\n**Permissions:**\n- You'll need the `Manage Server` permission to use this command.",
    "channels": "This command is for assigning specific channels for the bot's functions, like a channel for logging or a lobby for new members.\nYou can either 'set' a new channel or 'remove' an existing assignment.\n\n\n**Permissions:**\n- You'll need the `Manage Server` permission to use this command.",
    "roles": "Use this command to manage which roles the bot interacts with. You can configure roles to be assigned upon verification,\nincluding setting minimum and maximum age requirements for specific roles.\n\n\n**Permissions:**\n- You'll need the `Manage Server` permission to use this command.",
    "cooldown": "Set a cooldown period for how often a user can attempt verification in the lobby.\nThis can help prevent spam. The cooldown is set in minutes. You can set it to 0 to disable the cooldown entirely.\n\n**Permissions:**\n- You'll need the `Manage Server` permission to use this command.",
    "view": "This command provides a complete overview of the bot's current configuration for your server.\nIt's a handy way to see all your settings at a glance. The configuration will be sent as a text file.\n\n**Permissions:**\n- You'll need the `Manage Server` permission to use this command.\n- Only the bot developer can view the configuration of other guilds.",
    "cache": "This is a developer-only command used for internal purposes, specifically for caching message history from a channel.\nIt is not intended for regular server administrators.\n\n                        -- RMR LEGACY COMMAND, ONE TIME USE --\n\n**Permissions:**\n- This command can only be used by the bot's owner.",
    "stats": "Displays various statistics from the bot's database.\nThis provides a general overview of things like the number of user records, verifications, and active servers.\nThis information is maintained for administrative purposes and transparency.\n\n**Permissions:**\n- You'll need the `Manage Messages` permission to use this command.",
    "get": "Retrieves the ID check status for a specific user.\nThis command will show you if a user is flagged for a manual ID check, the reason for it, and if they have been verified.\nThe information is sensitive and will be shown to you privately.\n\n**Permissions:**\n- You'll need the `Manage Messages` permission to use this command.",
    "create": "Creates the button to start the secondary verification\n\nThis command creates a button in the specified channel that users can click to start the secondary verification process, which assigns them the reverification role upon successful verification.\n\n**Permissions:**\n- You need to have the `Manage Guild` permission to use this command.\n- Premium access is required to use this feature.",
    "update": "Updates a user's ID check status.\nYou can use this to manually flag a user for an ID check or to clear their flag after they've been verified.\nA reason is required to keep a log of why the status was changed.\n\n**Permissions:**\n- You'll need the `Administrator` permission to use this command.",
    "delete": "Removes a user's ID check entry from the database.\nThis effectively clears their ID check flag. This action is logged for security purposes.\n\n**Permissions:**\n- You'll need the `Administrator` permission to use this command.",
    "removal": "Starts the process to have your personal data removed from our database.\nWhen you use this command, we'll walk you through the next steps. Your data will be marked for deletion and permanently removed after a 30-day grace period.\nThis action is in accordance with your rights under GDPR.\n\nVerifying your age will cancel the removal process, abuse of this feature may result in blacklisting.\n\n**Permissions:**\n- No special permissions are needed. This command can be used by anyone to manage their own data.",
    "data": "Use this command to request a copy of all the personal data we have stored about you.\nFor your privacy and security, the bot will send this information directly to your DMs.\n\n**Permissions:**\n- No special permissions are needed. This command can be used by anyone to request their own data.",
    "send": "Sends a direct message to a user requesting they provide their ID for verification.\nThis command will first ask you for a reason, which will be included in the message to the user.\nThis is a premium feature.\n\n**Permissions:**\n- You'll need the `Manage Messages` permission.\n- This is a Premium-only command.",
    "verify_button": "Creates the main verification button in your lobby channel.\nWhen new users click this button, it kicks off the entire age verification process. You can customize the message that appears above the button.\n\n**Permissions:**\n- You'll need `Administrator` permission to use this command.",
    "idverify": "Manually verifies a user with their ID and date of birth.\nThis is a powerful tool for whitelisted servers to bypass the standard flow for trusted users.\nYou can choose whether to put them through the full lobby process or just verify them instantly.\n\n**Permissions:**\n- You'll need `Administrator` permission.\n- Your server must be whitelisted to use this command.",
    "returnlobby": "Moves a user who has already been verified back into the lobby.\nThis command will remove their verified roles and re-assign the unverified roles, effectively resetting their verification status on this server.\n\n**Permissions:**\n- You'll need the `Manage Messages` permission to use this command.",
    "agecheck": "Quickly calculates the age based on a given date of birth.\nThis is a simple utility to check how old someone is without going through the full verification process.\n\n**Permissions:**\n- You'll need the `Manage Messages` permission to use this command.",
    "approve": "Manually approves a user and grants them access to the server.\nThis is a prefix command used by moderators to approve a user after a manual review. It logs the approval and assigns the correct roles.\n\n**Permissions:**\n- You'll need the `Manage Messages` permission to use this command.",
    "raid_purge": "Kicks all users who joined during a suspected raid.\nThis command looks at the join messages in the lobby channel within a specified number of days and kicks all mentioned users.\nYou will be asked for confirmation before the purge begins.\n\n**Permissions:**\n- You'll need `Administrator` permission to use this command.",
    "lobby_purge": "Kicks users who have been waiting in the lobby for too long.\nThis command checks the age of the welcome messages in the lobby. If a message is older than the specified number of days, the mentioned user will be kicked.\nThis helps keep your lobby clean and removes inactive accounts.\n\n**Permissions:**\n- You'll need `Administrator` permission to use this command.",
    "server": "Curious about your server's growth? This command generates a graph showing the number of members who have joined and left your server over a specific period.\nYou can specify the number of days you want to look back on. It's a fantastic tool for tracking membership trends!",
    "all_bar_graph": "Want to see the bigger picture? This command shows the total number of joins and leaves across all servers using this bot.\nIt provides a global perspective on user activity.",
    "average_ages_graph": "Get a visual breakdown of the age demographics in your server! This command creates a pie chart showing the distribution of different age groups among your verified members.\nIt's a great way to understand the age range of your community.",
    "on_member_remove": "This event handler sends the survey to the user when they leave the server."
}